# будем описывать звездного дессантника trooper
# имя
name = 'John'
# возраст
age = 23
# средний балл в школе :D
average_score = 5.2
# выжил в бою или нет
is_alive = True

# введем что мы знаем о нашем бойце
print('Имя бойца', name, 'возраст', age, 'средний балл в школе',
      average_score, 'в последнем бою выжил', is_alive)

# выведем тип данных каждой характеристики
print('Имя бойца', type(name), 'возраст', type(age), 'средний балл в школе',
      type(average_score), 'в последнем бою выжил', type(is_alive))
